In [7]:
#  !pip install pandas  # Run this to install pandas if imports below don't work.

In [3]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
%matplotlib inline

In [4]:
___ = ''

In [5]:
pd.__version__

'1.2.4'

# Pandas DataFrames

## What is a DataFrame?

A DataFrame, simply put, is a **Table** of data.  It is a structure that contains multiple rows, each row containing the same labelled collection of data types.  For example, a DataFrame might look like this:

| (index) | Name | Age | Height | LikesIceCream |
| :---: | :--: | :--: | :--: | :--: |
| 0     | "Nick" | 22 | 3.4 | True |
| 1     | "Jenn" | 55 | 1.2 | True |
| 2     | "Joe"  | 25 | 2.2 | True |

Because each row contains the same data, DataFrames can also be thought of as a collection of same-length columns!

**Pandas** is a Python package that has a DataFrame class.  Using either the **DataFrame** class constructor or one of Pandas' many **read_()** functions, you can make your own DataFrame from a variety of sources.

## Making DataFrames Directly

#### From a List of Dicts

Dicts are named collections.  If you have many of the same dicts in a list, the DataFrame constructor can convert it to a Dataframe:

In [10]:
friends = [
    {'Name': "Nick", "Age": 31, "Height": 2.9, "Weight": 20},
    {'Name': "Jenn", "Age": 55, "Height": 1.2},
    {"Name": "Joe", "Height": 1.2, "Age": 25, },
]
pd.DataFrame(friends)

   Name  Age  Height  Weight
0  Nick   31     2.9    20.0
1  Jenn   55     1.2     NaN
2   Joe   25     1.2     NaN

#### From a Dict of Lists

In [8]:
df = pd.DataFrame({
    'Name': ['Nick', 'Jenn', 'Joe'], 
    'Age': [31, 55, 25], 
    'Height': [2.9, 1.2, 1.2],
})
df

   Name  Age  Height
0  Nick   31     2.9
1  Jenn   55     1.2
2   Joe   25     1.2

#### From a List of Lists

if you have a collection of same-length sequences, you essentially have a rectangular data structure already!  All that's needed is to add some column labels.

In [9]:
friends = [
    ['Nick', 31, 2.9],
    ['Jenn', 55, 1.2],
    ['Joe',  25, 1.2],
]
pd.DataFrame(friends, columns=["Name", "Age", "Height"])

   Name  Age  Height
0  Nick   31     2.9
1  Jenn   55     1.2
2   Joe   25     1.2

#### From an empty DataFrame
If you prefer, you can also add columns one at a time, starting with an empty DataFrame:

In [9]:
df = pd.DataFrame()
df['Name'] = ['Nick', 'Jenn', 'Joe']
df['Age'] = [31, 55, 25]
df['Height'] = [2.9, 1.2, 1.2]
df

   Name  Age  Height
0  Nick   31     2.9
1  Jenn   55     1.2
2   Joe   25     1.2

### Exercise: Making DataFrames from Scratch

Please recreate the table below as a Dataframe using one of the approaches detailed above:

| Year | Product | Cost |
| :--: | :----:  | :--: |
| 2015 | Apples  | 0.35 |
| 2016 | Apples  | 0.45 |
| 2015 | Bananas | 0.75 |
| 2016 | Bananas | 1.10 |

Discuss: Which approach did you choose?  What did you like about it?

### Reading Data from Files into a DataFrame


| File Format | File Extension | `read_xxx()` function | Dataframe Write Method | 
| :--:  | :--: | :--: | :--: |
| Comma-Seperated Values      | .csv           | `pd.read_csv()` | `df.to_csv()` |
| Tab-seperated Valuess       | .tsv, .tabular, .csv | `pd.read_csv(sep='\t')`, `pd.read_table()` | `df.to_csv(sep='\t')` `df.to_table()` |
| Excel Spreadsheet           |  .xls | `pd.read_excel()`                    | `df.to_excel()`  |
| Excel Spreadsheet 2010      | .xlsx | `pd.read_excel(engine='openpyxl')`   | `df.to_excel(engine='openpyxl')` |
| JSON                        | .json | `pd.read_json()`                     | `df.to_json()` |
| Tables in a Web Page (HTML) | .html | `pd.read_html()[0]`                  | `df.to_html()` |
| HDF5 | .hdf5, .h5, | `pd.read_hdf5()` |  `df.to_hdf5()` |

In [11]:
import pandas as pd

### File Format Exercises: "Roundtripping" write-read

run the code below to download the Titanic passengers dataset, and transform it into different file formats

In [46]:
url = 'https://raw.githubusercontent.com/mwaskom/seaborn-data/master/titanic.csv'
df = pd.read_csv(url)
df[:5]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [52]:
df.to_csv("titanic2001.tsv", sep=',')

#### Tab-Seperated Values

Save the dataframe to a TSV file.

Read the TSV file into Pandas again.

Open the file in Jupyter (right-click on it in the file browser, click open with editor).  What does the file it look like?

#### JSON

Save the dataframe to a JSON file.

In [51]:
df.to_json("titanic2001.json")

Read the JSON file into Pandas again.

Open the file in Jupyter (right-click on it in the file browser, click open with editor).  What does the file it look like?

#### HTML

Save the dataframe to a HTML file.

In [53]:
df.to_html("titanic2001.html")

Read the HTML file into Pandas again.

In [56]:
dfs = pd.read_html("https://statisticstimes.com/geography/countries-by-continents.php")
len(dfs)

3

In [57]:
dfs[0]

        0                                   1
0  Source  United Nations Statistics Division
1    Date                         22 Oct 2019

In [58]:
dfs[1]

,Region,Region.1,Region.2,Region.3,M49 code,Total
0,World,NaN,NaN,NaN,1,249
1,NaN,Africa,NaN,NaN,2,60
2,NaN,NaN,Northern Africa,NaN,15,7
3,NaN,NaN,Sub-Saharan Africa,NaN,202,53
4,NaN,NaN,NaN,Eastern Africa,14,22
5,NaN,NaN,NaN,Middle Africa,17,9
6,NaN,NaN,NaN,Southern Africa,18,5
7,NaN,NaN,NaN,Western Africa,11,17
8,NaN,Americas,NaN,NaN,19,57
9,NaN,NaN,Latin America and the Caribbean,NaN,419,52
10,NaN,NaN,NaN,Caribbean,29,28
11,NaN,NaN,NaN,Central America,13,8
12,NaN,NaN,NaN,South America,5,16
13,NaN,NaN,Northern America,NaN,21,5
14,NaN,Antarctica,NaN,NaN,10,1
15,NaN,Asia,NaN,NaN,142,50
16,NaN,NaN,Central Asia,NaN,143,5
17,NaN,NaN,Eastern Asia,NaN,30,7
18,NaN,NaN,South-eastern Asia,NaN,35,11
19,NaN,NaN,Southern Asia,NaN,34,9
20,NaN,NaN,Western Asia,NaN,145,18
21,NaN,Europe,NaN,NaN,150,52
22,NaN,NaN,Eastern Europe,NaN,151,10
23,NaN,NaN,Northern Europe,NaN,154,17
24,NaN,NaN,NaN,Channel Islands,830,3
25,NaN,NaN,Southern Europe,NaN,39,16
26,NaN,NaN,Western Europe,NaN,155,9
27,NaN,Oceania,NaN,NaN,9,29
28,NaN,NaN,Australia and New Zealand,NaN,53,6
29,NaN,NaN,Melanesia,NaN,54,5
30,NaN,NaN,Micronesia,NaN,57,8
31,NaN,NaN,Polynesia,NaN,61,10

In [59]:
dfs[2]

,No,Country or Area,ISO-alpha3 Code,M49 Code,Region 1,Region 2,Continent
0,1,Afghanistan,AFG,4,Southern Asia,NaN,Asia
1,2,Åland Islands,ALA,248,Northern Europe,NaN,Europe
2,3,Albania,ALB,8,Southern Europe,NaN,Europe
3,4,Algeria,DZA,12,Northern Africa,NaN,Africa
4,5,American Samoa,ASM,16,Polynesia,NaN,Oceania
...,...,...,...,...,...,...,...
244,245,Wallis and Futuna Islands,WLF,876,Polynesia,NaN,Oceania
245,246,Western Sahara,ESH,732,Northern Africa,NaN,Africa
246,247,Yemen,YEM,887,Western Asia,NaN,Asia
247,248,Zambia,ZMB,894,Eastern Africa,Sub-Saharan Africa,Africa
248,249,Zimbabwe,ZWE,716,Eastern Africa,Sub-Saharan Africa,Africa

Open the file in Jupyter (right-click on it in the file browser, click open with editor).  What does the file it look like?

Open it in your web browser by double-clicking on it in your file explorer. What does it look like in your web browser?

#### Excel

Note: Because XLS and XLSX are proprietary formats, you may need to install a couple extra packages for this to work (code below)

In [ ]:
!pip install openpyxl

Save the dataframe to an Excel file.

In [61]:
df.to_excel("file.xlsx", engine="openpyxl")

Read the HTML file into Pandas again.

Open the file in Jupyter (right-click on it in the file browser, click open with editor).  What does the file it look like?

In [70]:
!a b c

SyntaxError: invalid syntax (<ipython-input-70-bc472104b3ca>, line 1)

In [ ]:
ProtenGroups.tabular

In [66]:
df.to_csv("file.csv", index=False, )

In [67]:
df2 = pd.read_csv("file.csv")
# df2.to_csv("file2.csv")
df2

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [69]:
pd.read_csv("file2.csv", index_col="Unnamed: 0")

,Unnamed: 0.1,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

Open it in your spreadsheet program.  What does it look like?